Revit 2027 API
OptionalFunctionalityUtils.IsOBJImportLinkAvailable Method
 Checks whether the OBJ Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsOBJImportLinkAvailable()
Public Shared Function IsOBJImportLinkAvailable As Boolean
public:
static bool IsOBJImportLinkAvailable()
static member IsOBJImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the OBJ Import/Link functionality is available in the installed Revit.
Remarks
 OBJ Import/Link is optional functionality that does not have to be a part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace